In [2]:
import numpy as np
import pandas as pd 

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427
4    a  one -0.479173  1.245098

In [4]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
4    a  one -0.479173  1.245098
b
  key1 key2     data1     data2
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427

In [9]:
pieces=dict(list(df.groupby("key1")))
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.058886 -0.886490
 1    a  two  0.232474  0.891388
 4    a  one -0.479173  1.245098,
 'b':   key1 key2     data1     data2
 2    b  one -1.822757  1.911889
 3    b  two -0.063152 -0.681427}

In [10]:
pieces['a']

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
4    a  one -0.479173  1.245098

In [11]:
pieces['b']

  key1 key2     data1     data2
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427

In [14]:
df

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427
4    a  one -0.479173  1.245098

In [15]:
#過濾想要的欄位,subscript的語法
df[df['key1'] == 'a']

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
4    a  one -0.479173  1.245098

In [17]:
df[(df['key1'] == 'a') & (df['key2'] == 'one')]

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
4    a  one -0.479173  1.245098

In [18]:
df

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427
4    a  one -0.479173  1.245098

In [19]:
df.query('key1=="a"')

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
4    a  one -0.479173  1.245098

In [33]:
df.query('key1=="a"').query('key2=="one"')

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
4    a  one -0.479173  1.245098

In [26]:
df

  key1 key2     data1     data2
0    a  one  1.058886 -0.886490
1    a  two  0.232474  0.891388
2    b  one -1.822757  1.911889
3    b  two -0.063152 -0.681427
4    a  one -0.479173  1.245098